<?php 
$country = [
    'カナダ' =>
    ['オタワ','トロント','モントリオール'], //0
    'スイス'=>
    ['ジュネーブ','チューリッヒ','ベルン'], //2
    'ドイツ' =>
    ['ハンブルク','ブレーメン','ベルリン'], //2
    'スペイン' =>
    ['バルセロナ','マドリード','リスボン'], //1
    'オーストラリア'=>
    ['シドニー','メルボルン','キャンベラ'], //2
    'イギリス' =>
    ['ロンドン','エディンバラ','マンチェスター'] //0
    ];

    //$answers=[0,2,2,1,2,0]; 正解のインデックス番号
    $answers =[
        'カナダ' => 'オタワ',
        'スイス'=>'ベルン',
        'ドイツ' =>'ベルリン',
        'スペイン' =>'マドリード',
        'オーストラリア'=>'キャンベラ',
        'イギリス' =>'ロンドン'
    ];